package date_to_text.support_functions
import date_to_text.*

fun hoursToStr(hours: Int): String =
    when (hours) {
        0 -> "ноль часов"
        1 -> "один час"
        2 -> "два часа"
        3 -> "три часа"
        4 -> "четыре часа"
        5 -> "пять часов"
        6 -> "шесть часов"
        7 -> "семь часов"
        8 -> "восемь часов"
        9 -> "девять часов"
        10 -> "десять часов"
        11 -> "одиннадцать часов"
        12 -> "двенадцать часов"
        13 -> "тринадцать часов"
        14 -> "четырнадцать часов"
        15 -> "пятнадцать часов"
        16 -> "шестнадцать часов"
        17 -> "семнадцать часов"
        18 -> "восемнадцать часов"
        19 -> "девятнадцать часов"
        20 -> "двадчать часов"
        21 -> "двадцать один час"
        22 -> "двадцать два часа"
        23 -> "двадцать три часа"
        else -> incorrectDateWarning
    }